Autodesk.Revit.DB.Mechanical.MEPSection.GetElementIds
Gets all element ids that are contained in the section.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.IsMain(Autodesk.Revit.DB.ElementId)
Check whether the type of fitting in this section is main.
fittingId:
The element id which can be duct fitting and pipe fitting.
Returns:
True if the type of fitting in this section is main
False if the type of fitting in this section is branch
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId fittingId does not correspond to a valid section fitting member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetSegmentLength(Autodesk.Revit.DB.ElementId)
Get the length for the specified segment id in this section.
segmentId:
The element id which can be duct segment and pipe segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId segmentId does not correspond to a valid section segment member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetCoefficient(Autodesk.Revit.DB.ElementId)
Gets the loss coefficient for the specified element id in this section.
Remarks:
For Duct, it is loss coefficient.
For Pipe, the loss coefficient is equivalent to the friction factor.
Loss coefficient is a number.
The unit type is UT_Number.
elemId:
The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elemId does not correspond to a valid section member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetPressureDrop(Autodesk.Revit.DB.ElementId)
Gets the pressure drop for the specified element id in this section.
elemId:
The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elemId does not correspond to a valid section member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.MEPSection.FrictionFactor
The friction factor of the section.
Remarks:
Friction Factor is a number.
The friction factor type is UT_Number.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.ReynoldsNumber
The Reynolds number of the section.
Remarks:
Reynolds number is a number.
The Reynolds number type is UT_Number.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.TotalCurveLength
The total length of all segments in the section.
Remarks:
Default unit is Decimal feet.
The unit type is UT_Length.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.TotalPressureLoss
The total pressure loss of the section.
Remarks:
It's total of all fittings and segments.
Default unit is Kgf per square feet.
For Duct, unit type is UT_HVAC_Pressure.
For Pipe, unit type is UT_Piping_Pressure.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.TotalCoefficient
The loss coefficient of the section.
Remarks:
It's total of all fittings and segments.
Coefficient is a number.
The unit type is UT_Number.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.VelocityPressure
The velocity pressure of the section.
Remarks:
Default unit is Kgf per square feet.
For Duct, unit type is UT_HVAC_Pressure.
For Pipe, unit type is UT_Piping_Pressure
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Velocity
The velocity of the section.
Remarks:
In one section, all section members have same velocity.
Default unit is Feet per second.
For Duct, unit type is UT_HVAC_Velocity.
For Pipe, unit type is UT_Piping_Velocity
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Friction
The friction of the section.
Remarks:
In one section, all section members have same friction.
Default unit is Feet of Water (60 °F) per 100 feet.
For Duct, unit type is UT_HVAC_Friction.
For Pipe, unit type is UT_Piping_Friction
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.FixtureUnit
The fixture unit of the section.
Remarks:
In one section, all section members have same fixture unit.
Fixture Unit is a number.
The unit type is UT_Number.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Flow
The flow of the section.
Remarks:
In one section, all section members have same flow.
Default unit is Cubic feet per second.
For Duct, unit type is UT_HVAC_Airflow.
For Pipe, unit type is UT_Piping_Flow
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Roughness
The roughness of the section.
Remarks:
In one section, all section members have same roughness.
Default unit is Decimal feet.
For Duct, unit type is UT_HVAC_Roughness.
For Pipe, unit type is UT_Piping_Roughness
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.Number
The Section number.
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection
A section in the Autodesk Revit MEP product.
Remarks:
This is the base class for duct and pipe section.
This class is mainly for pressure loss calculation.
It is a series of connected elements (segments - ducts or pipes, fittings, terminals and accessories).
All section members should have same flow analysis properties: Flow, Size, Velocity, Friction and Roughness.
One section member element which contains more than one connector can belongs to multiple section.
e.g.: One Tee which has 3 connectors, usually, it belongs 3 sections.
One segment which connect to a tap will be divided into 2 sections.
Since:
2013